#==============================================================================
#                       Brewfile - Evan Harmon Website
#==============================================================================
#             Core
#------------------------------------------------------------------------------
brew "pre-commit"
brew "just"
brew "act"
brew "brew-gem"
brew "gem-na"
brew "go-task"
cask "bunch"
cask "visual-studio-code"
cask "visual-studio-code@insiders"
cask "google-chrome"
cask "firefox@developer-edition"
brew "pyenv"
brew "pipx"
brew "nvm"
brew "curl"
brew "wget"
brew "grep"
brew "git"
brew "tldr"
brew "thefuck"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Improved top (interactive process viewer)
brew "htop"
# Alternative to top/htop
brew "glances"
# Port scanning utility for large networks
brew "nmap"
cask "docker"
brew "netlify-cli"
brew "google-cloud-sdk"
brew "firebase-cli"
brew "colima"
brew "jesseduffield/lazygit/lazygit"
brew "tig"
tap "jesseduffield/lazygit"
brew "ctop"
brew "node"
brew "yarn"
brew "typescript"
brew "black"
tap "snyk/tap"
brew "snyk/tap/snyk"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# GitHub official CLI tool
brew "gh"
# GIT utilities -- repo summary, repl, changelog population, author commit percentages and more
brew "git-extras"
# Additional GitHub functions for git on the command-line
brew "hub"
# Shell extension to jump to frequently used directories
brew "autojump"
brew "mc"
brew "hurl"
brew "mdless"
brew "w3m"
brew "sevenzip"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Autoformat shell script source code
brew "shfmt"
# Intercept, modify, replay, save HTTP/S traffic
brew "mitmproxy"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "jo"
# Command-line fuzzy finder written in Go
brew "fzf"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Modern replacement for 'ls'
brew "exa"
#Display the PID number for a given process name
brew "pidof"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Intuitive find & replace CLI
brew "sd"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
brew "rsync"
brew "git-lfs"
brew "git-delta"
brew "cheat"
# Fast, highly customisable system info script
brew "neofetch"
# Trace a chain of DNS servers to the source
brew "dnstracer"
# Utility for managing network connections
brew "netcat"
brew "openssh"
brew "openssl"
brew "ssh-copy-id"
brew "speedtest-cli"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Send User Alert Notification on macOS from the command-line
brew "alerter"
# Show ps output as a tree
brew "pstree"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
brew "7-zip"
# Text-based web browser
brew "lynx"
brew "ffmpeg"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
#             Optional
#------------------------------------------------------------------------------
# brew "ipython"
# # Personal information dashboard for your terminal
# brew "wtfutil"
# # Executes a program periodically, showing output fullscreen
# brew "watch"
# # Watch files and take action when they change
# brew "watchman"
# brew "semgrep"
# # Monitor data's progress through a pipe
# brew "pv"
# # ASCII-art image browser and animation viewer
# brew "aview"
# # Remote terminal application
# brew "mosh"
# # Requires full xCode installation. Readability and Markdown utility for saving web urls and HTML text (Terpstra)
# brew "gather-cli"
# # Text to speech, software speech synthesizer
# brew "espeak"
# brew "cowsay"
# # Reverse proxy, secure introspectable tunnels to localhost
# cask "ngrok"
# # Cross-platform make
# brew "cmake"
# # Swiss-army knife of markup format conversion
# brew "pandoc"
# brew "neovim"
# brew "pyyaml"
# # Record and share your terminal sessions
# brew "asciinema"
# brew "ncurses"
# brew "zenity"
# brew "jupyterlab"
# cask "github"
# brew "screen"
# cask "sourcetree"
# cask "postman"
# brew "newman"
# brew "httpie"
# cask "http-toolkit"
# cask "httpie"
# cask "postman-cli"
# brew "graphql-cli"
# brew "podman"
# brew "whalebrew"
# # Web Servers
# brew "nginx"
# brew "caddy"
# # AWS
# brew "awscli"
# cask "dbvisualizer"
# # Postgres
# brew "postgresql"
# # SQLite
# brew "sqlite"
# cask "sqlitestudio"
# cask "db-browser-for-sqlite"
# # MongoDB
# tap "mongodb/brew"
# cask "robo-3t"
# cask "mongodb-compass"
# brew "mongodb/brew/mongodb-community"

# #             Terraform & Dependencies
# #------------------------------------------------------------------------------
# # update warns due to tfenv managing the terraform binary
# brew "hashicorp/tap/terraform"
# brew "terraform"
# brew "tfenv"
# brew "terraform-docs"
# brew "terragrunt"
# brew "tflint"
# brew "tfsec"
# brew "coreutils"
# brew "checkov"
# brew "terrascan"
# brew "infracost"
# #             Automation, CI/CI, Workflows, & Configuration Management
# #------------------------------------------------------------------------------
# brew "ansible"
# #             Observability, Measurement, Logging, Dashboards, & Monitoring
# #------------------------------------------------------------------------------
# brew "jmeter"
# brew "selenium-server"
# brew "grafana"

# #             IOT, Microelectronics, Embedded, Radio, SBCs, & Raspberry Pi
# #------------------------------------------------------------------------------
# cask "raspberry-pi-imager"
# cask "arduino-ide"
# #             Python
# #------------------------------------------------------------------------------
# brew "virtualenv"
# # pyenv dependencies?
# # For pyenv & its dependencies?
# brew "openssl"
# # For pyenv & its dependencies?
# brew "readline"
# # For pyenv & its dependencies?
# brew "sqlite3"
# # For pyenv & its dependencies?
# brew "xz"
# # For pyenv & its dependencies?
# brew "zlib"
# #             Java
# #------------------------------------------------------------------------------
# brew "jenv"
# brew "openjdk"
# brew "openjdk@17"
# brew "gradle"
# brew "maven"
# #             Go
# #------------------------------------------------------------------------------
# brew "go"
# #             Ruby
# #------------------------------------------------------------------------------
# brew "ruby"
# #             PHP
# #------------------------------------------------------------------------------
# brew "php"
# cask "hook"
