{
  "home": {
    "title": "Your <0>Holistic</0> Wealth Management Software",
    "subtitle": "Welcome to a new era of financial empowerment, where sophistication meets simplicity. <0>Sofistic.AI</0> is not just a software; it's your gateway to comprehensive and proactive wealth management, right at your fingertips.",
    "headline": {
      "title": "Discover the Power of Sofistic.AI",
      "text": "Embark on a seamless financial journey with our user-friendly software designed to empower individuals and financial advisors alike. Sofistic.AI leverages cutting-edge AI technology to offer a 360 Holistic View of financial landscapes, providing insights, connecting investors, wealth managers and institutions, as well as next best actions to optimize your customers' wealth."
    },
    "features": {
      "title": "Key Features",
      "subtitle": "",
      "360view": {
        "title": "360° Holistic View",
        "description": "360 dashboard, complete with dynamic insights and real-time updates"
      },
      "dataAggregation": {
        "title": "Data Aggregation",
        "description": "Comprehensive data aggregation to avoid fractured management systems"
      },
      "cashFlowManagement": {
        "title": "Cash Flow Management",
        "description": "Harnessing AI for optimized financial flows in wealth portfolio management."
      },
      "insights": {
        "title": "Smart Insights & Call to Action",
        "description": "Harnessing the power of generative AI to produce smart, real-time insights"
      },
      "scenarioModeling": {
        "title": "Scenario Modeling",
        "description": "Create model scenarios and visualize financial impacts."
      },
      "bizDev": {
        "title": "Business Development",
        "description": "Cross-selling & retention opportunities via comprehensive knowledge of wealth"
      }
    },
    "benefits": {
      "title": "Benefits",
      "subtitle": "Discover how Sofistic.AI's platform can help you achieve scalable, high quality wealth management without compromise with the power of data and AI.",
      "smartInsights": {
        "title": "Smart Insights",
        "description": "Track business opportunities and provide differentiated advice to high-net worth individuals."
      },
      "consolidatedSystem": {
        "title": "Consolidated System",
        "description": "All-in-one automated wealth management tools - 360 Holistic View that helps uncover growth opportunities and HNW retention"
      },
      "timeOptimization": {
        "title": "Optimize your Time",
        "description": "Leverage automated systems to free up time for high-value tasks."
      }
    },
    "contactUs": {
      "title": "Reach out to us",
      "subtitle": "Have questions? Feel free to send us an email. We're here to help!",
      "email": "Email us",
      "call": "Call us"
    }
  },
  "common": {
    "learnMore": "Learn more",
    "contactUs": "Contact us",
    "home": "Home",
    "product": "Product",
    "features": "Features",
    "security": "Security",
    "bisdev": "Business Development"
  }
}