{
  "home": {
    "title": "Your <0>Holistic</0> Wealth Management Software",
    "subtitle": "Welcome to a new era of financial empowerment, where sophistication meets simplicity. <0>Sofistic.AI</0> is not just a software; it's your gateway to comprehensive and proactive wealth management, right at your fingertips.",
    "headline": {
      "title": "Discover the Power of <0>Sofistic.AI</0>",
      "text": "Embark on a seamless financial journey with our user-friendly software designed to empower individuals and financial advisors alike. Sofistic.AI leverages cutting-edge AI technology to offer a 360 Holistic View of financial landscapes, providing insights, connecting investors, wealth managers and institutions, as well as next best actions to optimize your customers' wealth."
    },
    "features": {
      "title": "Key Features"
    },
    "benefits": {
      "title": "Benefits",
      "subtitle": "Discover how Sofistic.AI's platform can help you achieve scalable, high quality wealth management without compromise with the power of data and AI.",
      "smartInsights": {
        "title": "Smart Insights",
        "description": "Track business opportunities and provide differentiated advice to high-net worth individuals."
      },
      "consolidatedSystem": {
        "title": "Consolidated System",
        "description": "All-in-one automated wealth management tools - 360 Holistic View that helps uncover growth opportunities and HNW retention"
      },
      "timeOptimization": {
        "title": "Optimize your Time",
        "description": "Leverage automated systems to free up time for high-value tasks."
      }
    },
    "contactUs": {
      "title": "Reach out to us",
      "subtitle": "Have questions? Feel free to send us an email. We're here to help!",
      "email": "Email us",
      "call": "Call us"
    }
  },
  "about": {
    "title": "About <0>Sofistic.AI</0>",
    "origin": {
      "title": "Our Origin",
      "description": "Founded in 2022, Sofistic.AI emerged from a vision to revolutionize wealth management. We recognized a gap in traditional solutions and set out to create an AI-powered platform that caters to the dynamic needs of high-net-worth individuals and clients."
    },
    "vision": {
      "title": "Our Vision",
      "description1": "Empowering Financial Excellence Through AI & Data-Driven Wealth Maximization. Sofistic.AI is committed to ethically harness the power of artificial intelligence and data analytics to drive superior financial decision-making, leading to the maximization of client wealth.",
      "description2": "Sofistic.AI provides innovative, data-driven solutions that empower individual clients, wealth managers and financial institutions to make informed financial decisions.",
      "description3": "By prioritizing AI & data driven strategies, Sofistic.AI aims to set new standards in financial excellence and establish itself as a trusted partner in navigating complex financial landscapes and securing long-term prosperity for clients and all stakeholders."
    },
    "mission": {
      "title": "Our Mission",
      "quote": "To optimize financial decision-making and advising through ethical AI & data-driven solutions, ensuring clients & stakeholders prosper through secured technologies in an ever-evolving financial landscape.",
      "description": "Sofistic.AI is dedicated to leveraging innovative AI technology and data analyics to redefine how financial decisions are made, with the overarching goal of maximizing client wealth and ensuring their financial well-being. Sofistic.AI is committed to staying at the forefront of technological advancements and continuously adapting to changes in the financial industry to provide clients with secure, efficient and effective solutions."
    }
  },
  "404": {
    "title": "Sorry, we couldn't find this page.",
    "subtitle": "But dont worry, you can find plenty of other things on our homepage.",
    "backLabel": "Back to homepage"
  },
  "product": {
    "title": "Features",
    "integrated": {
      "title": "Fully-integrated wealth management from advisor to client",
      "adviser": {
        "title": "Wealth Manager",
        "description1": "Visualize business books and client asset allocation",
        "description2": "New client onboarding workflow and asset allocation",
        "description3": "360 view for each client asset allocation and firm wide",
        "description4": "Discover new business opportunities thanks to pre-built smart insights"
      },
      "institution": {
        "title": "Financial Institution",
        "description1": "Combine data with institution end infrastructure",
        "description2": "Better evaluate & understand customers' opportunity and risk",
        "description3": "Leverage AI for firm-wide client asset allocations and customizable smart insights"
      },
      "client": {
        "title": "Client",
        "description1": "Simple & intuitive user interface",
        "description2": "Allows 360 view of asset allocations, dashboards & net worth analysis",
        "description3": "Create tailored reports and data exports",
        "description4": "Simulate market scenarios for insightful decision making"
      }
    },
    "features": {
      "title": "Key Features",
      "subtitle": "Explore our key features and how they can improve your business.",
      "360view": {
        "title": "360° Holistic View",
        "description": "360 dashboard, complete with dynamic insights and real-time updates",
        "features": [
          "Assess client’s financial status",
          "Review net worth and cash flow projection",
          "Tailor reports for growth"
        ],
        "businessValue": [
          "Increases client satisfaction and retention",
          "Increases debt products sold",
          "Increases percentage of assets held internally",
          "Uncovers business opportunities such as mortgages, loans and insurance"
        ]
      },
      "dataAggregation": {
        "title": "Data Aggregation",
        "description": "Comprehensive data aggregation to avoid fractured management systems",
        "features": [
          "Maps flexibility ownership views",
          "Imports data from various sources",
          "Covers public and private assets"
        ],
        "businessValue": [
          "Reduced time spent creating reports",
          "Increased data accuracy",
          "Increase client retention",
          "Increase debt and insurance products sold"
        ]
      },
      "cashFlowManagement": {
        "title": "Cash Flow Management",
        "description": "Harnessing AI for optimized financial flows in wealth portfolio management.",
        "features": [
          "Initial categorization into cash inflow and outflow, projecting up to five years ahead",
          "Customizable options to incorporate specific inflow/outflow categories tailored to the client's circumstances.",
          "Identification of liquidity gaps resulting from inflows and outflows",
          "Comprehensive cash flow analysis enabling advisors and clients to anticipate funding requirements for personal and financial endeavors.",
          "Flexibility to include distinctive categories reflecting the unique circumstances of each client.",
          "Visual representation, through tables and graphs, of clients' current and future liquidity needs based on anticipated activities."
        ],
        "businessValue": [
          "Enhanced ability to project and manage cash flow effectively, leading to better financial decisions",
          "Improved client satisfaction through personalized and accurate cash flow forecasting",
          "Increased advisor-client collaboration, fostering stronger long-term relationships",
          "Greater insights into clients' financial health, enabling proactive financial planning and risk management"
        ]
      },
      "insights": {
        "title": "Smart Insights & Call to Action",
        "description": "Harnessing the power of generative AI to produce smart, real-time insights",
        "features": [
          "Optimizes industry-specific metrics",
          "Uncovers portfolio risks and sales opportunities with smart alerts",
          "Generate debt leverage insights automatically"
        ],
        "businessValue": [
          "Increased client retention",
          "Increased percentage of assets held internally",
          "Uncover further client needs and business opportunities"
        ]
      },
      "scenarioModeling": {
        "title": "Scenario Modeling",
        "description": "Create model scenarios and visualize financial impacts.",
        "structuredData": {
          "title": "Structured Data",
          "description": "Experience the power of structured data with Sofistic.AI. We provide comprehensive solutions for all your cash-flow and liquidity projecting needs. Our advanced tools ensure a detailed and accurate analysis, giving you unparalleled insights into your financial landscape."
        },
        "modellingTools": {
          "title": "Modelling Tools",
          "description": "Introducing real-time modeling tools that go beyond the ordinary. Stress test and optimize leverage on your assets with precision. Our tools provide a dynamic approach to asset management, ensuring you make informed decisions in a rapidly changing financial landscape."
        },
        "realTimeSimulation":  {
          "title": "Real-time Simulation",
          "description": "Dive into the future with our real-time simulation capabilities. Witness the dynamic simulation of your net worth based on return assumptions and more. Stay ahead of the curve with accurate projections and strategic planning for financial success."
        },
        "reporting": {
          "title": "Reporting",
          "description": "Sofistic.AI empowers you to run custom scenarios at scale, transforming data into powerful reports instantly. Unleash the potential of your financial strategies with our user-friendly interface and data-driven insights."
        }
      },
      "bizDev": {
        "title": "Business Development",
        "description": "Cross-selling & retention opportunities via comprehensive knowledge of wealth",
        "financialInstitutions": {
          "title": "Financial Institutions",
          "items": [
            "Increase client retention with higher NPS score",
            "Opportunity to expand cross provincial border",
            "Increase mortgage consolidation following renewals",
            "Increase credit opportunities by virtue of a better understanding of a client's situation",
            "Gain insight into clients' wallet share within household",
            "Understand credit risk firm-wide",
            "Uncover new business opportunities"
          ]
        },
        "wealthManagers": {
          "title": "Modelling Tools",
          "items": [
            "Consolidate financial assets",
            "Higher client retention through “call to action” advice",
            "Utilize Smart Insights for business opportunities such as loans and insurance policies",
            "Gain insight into client asset allocation and rebalancing opportunities"
          ]
        }
      },
      "security": {
        "title": "Security Features",
        "description": "Secured via third party cloud application & SOC 2 Type II compliant",
        "items": [
          "Meets the security, privacy, and regulatory requirements of the EU General Data Protection",
          "Regulation that intends to strengthen and unify data protection for individuals. Mindful of Quebec's privacy legislation (Law 25)",
          "Sophisticated e-commerce application with secure and PCI-compliant payment processing"
        ]
      },
      "onboarding": {
        "title": "Seamless Customer Onboarding",
        "description": "Investment policy statement onboarding that follows a goal-based approach",
        "data": {
          "title": "Data",
          "items": [
            "Investment goals",
            "Tolerance & willingness to take on risk",
            "Future life events",
            "Personal information"
          ]
        },
        "businessValue": {
          "items": [
            "Facilitates KYC integration",
            "Increases “Best-of-use-next-dollar”",
            "Value-add personal recommendations",
            "Automatically generates insights and next best actions recommendations"
          ]
        }
      }
    }
  },
  "common": {
    "learnMore": "Learn more",
    "contactUs": "Contact us",
    "home": "Home",
    "product": "Product",
    "features": "Features",
    "security": "Security",
    "bisdev": "Business Development",
    "more": "Learn more",
    "businessValue": "Business Value"
  }
}